**Submitted By: AAKASH MITTAL aakashmittal0207@gmail.com (7906835097)**

Excel Task file: https://drive.google.com/file/d/17YBlvt8l0S0WQWEhpW7DsuXATe3plgFB/view?usp=sharing

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('customer_data.csv')
df

   customer_id  age gender            email  purchases
0         1001   35      M  abc@example.com       10.0
1         1002   28      F  def@example.com        5.0
2         1003   40      F  ghi@example.com        NaN
3         1004   45      M  jkl@example.com        8.0
4         1005   33      M  mno@example.com       15.0
5         1006   27      F  pqr@example.com        NaN
6         1007   50      M  stu@example.com       12.0
7         1008   29      F  vwx@example.com        7.0
8         1009   38      F  yza@example.com        9.0

In [3]:
# Reading Dataset

In [4]:
df.head()

   customer_id  age gender            email  purchases
0         1001   35      M  abc@example.com       10.0
1         1002   28      F  def@example.com        5.0
2         1003   40      F  ghi@example.com        NaN
3         1004   45      M  jkl@example.com        8.0
4         1005   33      M  mno@example.com       15.0

In [5]:
df.shape

(9, 5)

In [6]:
df.isnull().sum()

customer_id    0
age            0
gender         0
email          0
purchases      2
dtype: int64

**Observation:   Dataset has 4 columns that is ['customer_id', 'age', 'gender', 'email', 'purchases', 'revenue'] and 9 rows. 2 null values is present in the 'purchase' coloumn.**

In [8]:
# Data cleaning: Removing duplicates and handling missing values

In [9]:
# Remove duplicates based on customer_id
df.drop_duplicates(subset='customer_id', inplace=True)

In [17]:
# Handle missing values in the 'purchases' column by filling with a mean value 

df['purchases'] = df['purchases'].fillna(df['purchases'].mean())

In [18]:
df.isnull().sum()

customer_id    0
age            0
gender         0
email          0
purchases      0
dtype: int64

**Observation:   Dataset is now cleaned, No null and duplicate values are present.**

In [21]:
# Calculate the average number of purchases for each gender
average_purchases_by_gender = df.groupby('gender')['purchases'].mean()

**Observation: Print the result**

In [20]:
print("Average Number of Purchases by Gender:")
print(average_purchases_by_gender)

Average Number of Purchases by Gender:
gender
F     7.971429
M    11.250000
Name: purchases, dtype: float64